In [ ]:
import pandas as pd
# df = pd.read_excel("data/raw/Observations 2012-2025.xlsx")

df_species = pd.read_excel("data/raw/Observations 2012-2025.xlsx", sheet_name="ESPECES")
df_sites = pd.read_excel("data/raw/Observations 2012-2025.xlsx", sheet_name="GPS-MILIEU")
df_observations = pd.read_excel("data/raw/Observations 2012-2025.xlsx", sheet_name="NOM FRANÇAIS")

In [16]:
df_species.head()

,Unnamed: 0,Unnamed: 1,Aigrette bleue,Egretta caerulea,Migrateur
0,NaN,NaN,Aigrette garzette,Egretta garzetta,Migrateur
1,NaN,NaN,Aigrette neigeuse,Egretta thula,Migrateur
2,NaN,NaN,Aigrette tricolore,Egretta tricolor ruficollis,Migrateur
3,NaN,NaN,Amazone aourou,Amazona amazonica,Exogène introduit par l'homme
4,NaN,NaN,Astrild à joues orange,Estrilda melpoda,NaN

In [17]:
df_sites.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,WGS84 UTM 20,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,NaN,NaN,Transect,X,Y,NaN,NaN,NaN
1,NaN,NaN,Aéroport,714593,1614233,Mangrove,S1,SIPI
2,NaN,NaN,Aéroport,714416,1614194,Mangrove,S1,S1P2
3,NaN,NaN,Aéroport,714133,1614141,Mangrove,S1,S1P3
4,NaN,NaN,Aéroport,713914,1614103,Mangrove,S1,S1P4

In [18]:
df_observations.head()

,Nom observateur,code département,Nom transect,date,"1er, 2e ou 3e passage",nuages,pluie,vent,visibilité,N° point,...,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,totaux,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,<100m,NaN,> 100m,NaN,vol,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,Auditif,Visuel,Auditif,Visuel,NaN,Auditif,"Visuel (sans""Vol"")","A+V (sans ""Vol"")","A+V (avec ""Vol"")",NaN
2,BELFAN David,972.0,Fond l'Etang,2014-04-12 00:00:00,1.0,2,1.0,1.0,1.0,1.0,...,NaN,NaN,NaN,NaN,NaN,1,0,1,1,NaN
3,BELFAN David,972.0,Fond l'Etang,2014-04-12 00:00:00,1.0,2,1.0,1.0,1.0,1.0,...,NaN,NaN,NaN,NaN,NaN,0,1,1,1,NaN
4,BELFAN David,972.0,Fond l'Etang,2014-04-12 00:00:00,1.0,2,1.0,1.0,1.0,1.0,...,NaN,NaN,NaN,NaN,NaN,0,2,2,2,NaN